# 2 Даны два числа. Показать большее и меньшее число

print("Введите первое число")
a = int(input())
print("Введите второе число")
b = int(input())
if a<b: 
    print ("Первое меньше второго")
else: print ("Первое больше второго")