# 29 Написать программу вычисления произведения чисел от 1 до N



n=5
F=1
for i in range (1,n+1):
    F=F*i
print (F)