# 42. Определить сколько чисел больше 0 введено с клавиатуры


def CheckCount (a):
    if a>0:
        count+=1
    return count
l=int []
print ((type(l)))
print (count)
# int[] A = new int [n];
n=5
for i in range (5):
    l=int(input('введите число '))
print (l)

CheckCount(l)


# {
    
#     Console.Write($"Введите {i+1} число: ");
#     A[i]= Convert.ToInt32 (Console.ReadLine());
# }
# int count=0;
# for (int i=0; i<n; i++)
# {
#     if (A[i]>0) {count++;}
# }
# Console.WriteLine ($"число больше нуля встречается {count} раз");