# 20 Определить, присутствует ли в заданном 
# списке строк, некоторое число 

print('Тимофей ложись спать')
a=input('как тебя зовут? ')
print(a)