# По двум заданным числам проверить является ли одно квадратом второго 
# Найти максимальное из пяти чисел

def max1(list):
    max = list[0]
    for i in list:
        if i > max:
            max = i
    return 
print (max1)
# Вывести на экран числа от -N до N
print [(i for i in range(10))]
# Показать первую цифру дробной части числа
# Дано число. Проверить кратно ли оно 5 и 10 или 15 но не 30
# Дано число обозначающее день недели. Вывести его название и указать является ли он выходным.
# Проверить истинность утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат
# Сообщить в какой четверти координатной плоскости или на какой оси находится точка с координатами Х и У 
# Указав номер четверти прямоугольной системы координат, показать допустимые значения координат для точек этой четверти
# Найти расстояние между двумя точками пространства
# Семинар 1-2: примерный список задач

